info/apdl-config.el
;;; apdl-config.el --- Customisation example for APDL-Mode
;; This file was built from the file "apdl-config.org".

;; Copyright (C) 2016 - 20202 H. Dieter Wilhelm, GPL V3
;; Author: H. Dieter Wilhelm <dieter@duenenhof-wilhelm.de>
;; Version: 20.4.0
;; Package-Requires: ((emacs "25.1"))
;; Keywords: languages, convenience, tools, Ansys, APDL
;; URL: https://github.com/dieter-wilhelm/apdl-mode

;; Maintainer: H. Dieter Wilhelm
;; Created: 2006-02

;; Parts of this mode were originally base on octave-mod.el: Copyright
;; (C) 1997 Free Software Foundation, Inc.  Author: Kurt Hornik
;; <Kurt.Hornik@wu-wien.ac.at> Author: John Eaton
;; <jwe@bevo.che.wisc.edu>

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; This code is free software; you can redistribute it and/or modify
;; it under the terms of the GNU General Public License as published
;; by the Free Software Foundation; either version 3, or (at your
;; option) any later version.
;;
;; This lisp script is distributed in the hope that it will be useful,
;; but WITHOUT ANY WARRANTY; without even the implied warranty of
;; MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
;;
;; Permission is granted to distribute copies of this lisp script
;; provided the copyright notice and this permission are preserved in
;; all copies.
;;
;; You should have received a copy of the GNU General Public License
;; along with this program; if not, you can either send email to this
;; program's maintainer or write to: The Free Software Foundation,
;; Inc.; 675 Massachusetts Avenue; Cambridge, MA 02139, USA.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;; Commentary:
;; The customisations itself are written in `Emacs-Lisp'.
;; The comment is ~;~ (one semi-colon `;').  Textual hints
;; are indicated with DOUBLE semi-colons `;;', optionally uncomment
;; the code lines with a SINGLE comment sign.

;; Please add the interesting code lines into your GNU-Emacs init file or
;; load this file in the init file with `(load-file
;; "PATH/apdl-config.el")'.

;;; CODE:

;; conditional for Linux and Windows

;(cond ((string= window-system "x")
;        ;; This is an example of an installation directory on GNU-Linux
;        (setq apdl-ansys-install-directory "/appl/ansys_inc/v201/"))
;        ;;default: "/ansys_inc/v201/"
;       (t
;        ;;This an example of an installation dir. on WINDOWS
;        ;; Emacs is using here also forward slashes ans under
;        ;; Unix and not "\"!
;        (setq apdl-ansys-install-directory "D:/Ansys/v210/"))
;        ;; default: "C:/Program Files/Ansys Inc/v201/"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; file suffixes for autoloading of APDL-Mode, appropriate file
;; suffixes for which Ansys mode is automatically called for

;; .mac is the macro suffix of Ansys i. e. these macros can be called
;; in the Ansys command prompt like a regular Ansys function (without
;; the suffix .mac).  See the file doc/example.mac

;; APDL-Mode has configured GNU-Emacs to open files with this suffix
;; under apdl-mode.

;; (add-to-list 'auto-mode-alist '("\\.mac$" . apdl-mode))
(add-to-list 'auto-mode-alist '("\\.ans$" . apdl-mode))

;; .dat and .inp are WorkBench's solver input file suffixes
;; See the file doc/example.dat

;; APDL-Mode has configured GNU-Emacs to open files with these suffixes
;; under apdl-mode.

;; (add-to-list 'auto-mode-alist '("\\.dat$" . apdl-mode))
;; (add-to-list 'auto-mode-alist '("\\.inp\\'" . apdl-mode))

;; .anf is the suffix for "Ansys Neutral" files which include mostly
;;  gometric data but also some APDL snippets. See the file
;;  doc/example.anf.
(add-to-list 'auto-mode-alist '("\\.anf$" . apdl-mode))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			  ;; Auto insertion
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; auto insertion stuff (when creating a new APDL file)

; (auto-insert-mode 1)		        ; insert automatically templates
; (add-hook 'find-file-hook 'auto-insert) ; when opening new files
; (setq auto-insert-query t)   ; aks for auto insertion of APDL template
; (add-to-list 'auto-insert-alist
;  '(apdl-mode . [apdl-skeleton-outline-template])) ;which template to insert

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			  ;; Miscellaneous
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(setq apdl-parameter-help-duration "2 min")
(setq apdl-parameter-help-duration 30) ; 30 seconds

;; If you want to read the manual in GNU-Emacs' EWW browser.  This
;; might only work for locally installed help documents (1.7 GB
;; package v201) since v191 the online help is the default.

; (setq browse-url-browser-function 'eww-browse-url)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			     ;; Outlining
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
