doc/apdl-config.org
* COMMENT Autoloading (became obsolete with the packaging system)
  Below set of useful commands can be interactively called (with M-x
  ...)  even when APDL Mode was not activated i.e. its lisp files not
  yet loaded, with the following code.
  #+BEGIN_SRC emacs-lisp
(autoload 'apdl "apdl-mode" "Opening an empty buffer in APDL-Mode" 'interactive)
(autoload 'apdl-mode "apdl-mode" nil t)
(autoload 'apdl-customise-ansys "apdl-mode" "Activate the function for
 calling a special Ansys customisation buffer." 'interactive)
(autoload 'apdl-abort-file "apdl-mode" "Activate the function for  aborting Ansys runs." 'interactive)
(autoload 'apdl-display-error-file "apdl-mode" "Activate the function for inspecting the Ansys error file." 'interactive)
(autoload 'apdl-start-apdl-help "apdl-mode" "Activate the function for starting the Ansys help browser." 'interactive)
(autoload 'apdl-start-ansys "apdl-mode" "Activate the function for starting the APDL interpreter under GNU-Linux or product launcher under Windows." 'interactive)
(autoload 'apdl-start-classics "apdl-mode" "Activate the function for starting the MAPDL in GUI Mode (APDL-Classics)." 'interactive)
(autoload 'apdl-start-wb "apdl-mode" "Activate the function for starting Workbench." 'interactive)
(autoload 'apdl-license-status "apdl-mode" "Activate the function for displaying Ansys license status or starting a license utility." 'interactive)
(autoload 'apdl-mode-version "apdl-mode" "Show APDL-Mode's version number." 'interactive)
  #+END_SRC

#+BEGIN_SRC emacs-lisp :exports none  :tangle yes
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			      ;; Autoloading
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; Set of useful commands which are interactively available (M-x ...)
;; even when APDL Mode was not (yet) activated i.e. the lisp files not
;; loaded.

  (autoload 'apdl "apdl-mode" "Opening an empty buffer in APDL-Mode" 'interactive)
  (autoload 'apdl-mode "apdl-mode" "Switch to APDL-Mode" 'interactive)
  (autoload 'apdl-customise-ansys "apdl-mode" "Activate the function for
  calling a special Ansys customisation buffer." 'interactive)
  (autoload 'apdl-abort-file "apdl-mode" "Activate the function for  aborting Ansys runs." 'interactive)
  (autoload 'apdl-display-error-file "apdl-mode" "Activate the function for inspecting the Ansys error file." 'interactive)
  (autoload 'apdl-start-apdl-help "apdl-mode" "Activate the function for starting the Ansys help browser." 'interactive)
  (autoload 'apdl-start-ansys "apdl-mode" "Activate the function for starting the APDL interpreter under GNU-Linux or product launcher under Windows." 'interactive)
  (autoload 'apdl-start-classics "apdl-mode" "Activate the function for starting the MAPDL in GUI Mode (APDL-Classics)." 'interactive)
  (autoload 'apdl-start-wb "apdl-mode" "Activate the function for starting Workbench." 'interactive)
  (autoload 'apdl-license-status "apdl-mode" "Activate the function for displaying Ansys license status or starting a license utility." 'interactive)
  (autoload 'apdl-mode-version "apdl-mode" "Show APDL-Mode's version number." 'interactive)

#+END_SRC

* Outlining
  Activating outline minor mode for selectively hiding and unhiding
  code sections:

#+BEGIN_SRC emacs-lisp
  (add-hook 'apdl-mode-hook 'apdl-outline-minor-mode) ;enable outlining
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			     ;; Outlining
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; activating outline minor mode for selectively hiding/unhiding
;; sections

(add-hook 'apdl-mode-hook 'apdl-outline-minor-mode) ;enable outlining

#+END_SRC

* Highlighting (Colourisation)
** Dynamic highlighting of variables
The following toggles a dynamics change of the highlighting: While
you are editing your new variable definitions highlighted and the
cursor position is shown in the parameter help overlay

Uncommenting the following might slow the editing of large .mac
files (but only when apdl-highlighting-level is set to 2, see
below).
#+BEGIN_SRC emacs-lisp
(setq apdl-dynamic-highlighting-flag nil)
; (setq apdl-dynamic-highlighting-flag t) ;default: t

#+END_SRC
** Decoration levels
Decoration levels 0,1,2 are available.  User variable highlighting is
only in level 2 available (statical, if above flag is not set), the
current default is 2

#+BEGIN_SRC emacs-lisp
(setq apdl-highlighting-level 1) ; default: 2
#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
		     ;; Highlighting/Colourisation
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;; The following toggles a dynamics change of the highlighting: While
;; you are editing your new variable definitions highlighted and the
;; cursor position is shown in the parameter help overlay

;; Uncommenting the following might slow the editing of large .mac
;; files (but only when apdl-highlighting-level is set to 2, see
;; below).

; (setq apdl-dynamic-highlighting-flag nil)
; (setq apdl-dynamic-highlighting-flag t) ; default

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; fontification (highlighting) of user variables and decoration
;; levels (0,1,2 are available), user variables highlighting is only
;; in level 2 available (statical, if above flag is not set), the
;; default is 2

; (setq apdl-highlighting-level 1) ; default: 2

#+END_SRC
* Ansys installation dependent configurations
Further things you possibly have to configure if your Ansys
installation is completely differing from a default Ansys installation
path, or if you want to mix various Ansys versions:
#+BEGIN_SRC emacs-lisp
  (setq apdl-ansys-help-program
      "/appl/ansys_inc/20.0.1/v201/commonfiles/help/HelpViewer/AnsysHelpViewer.exe")
      ;; normally it looks like this:
      ;; "/ansys_inc/v201/commonfiles/help/HelpViewer/AnsysHelpViewer.exe"
  ;; On WINDOWS: slash before /d: is unnecessary, but possible?
  (setq apdl-ansys-help-path "d:/Program Files/Ansys Inc/16.2.0/v201/commonfiles/help/en-us/help/")
  (setq apdl-ansys-help-path "/appl/ansys_inc/16.2.0/v201/commonfiles/help/en-us/help/")
  (setq apdl-ansys-launcher "/appl/ansys_inc/v201/ansys/bin/winx64/launcher")
  (setq apdl-ansys-wb "/appl/ansys_inc/v201/Framework/bin/Linux64/runwb2")
  (setq apdl-ansys-program "/appl/ansys_inc/19.3.0/ansys/bin/ansys195")
  (setq apdl-lmutil-program "/appl/ansys_inc/19.3.0/shared_files/licensing/linx64/lmutil")

#+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
			   ;; Ansys version and paths
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    ;; Things you might have to configure if your Ansys installation is
    ;; completely differing from default Ansys installation paths, as in
    ;; the example below, or you want to use a mixed version system:

    ; (setq apdl-help-program
    ;   "/appl/ansys_inc/16.2.0/v201/commonfiles/help/HelpViewer/AnsysHelpViewer.exe")
    ; ;; the Ansys path to the help viewer looks normally like this:
    ; ;; "/INSTALL_DIRECTORY/ansys_inc/v201/commonfiles/help/HelpViewer/AnsysHelpViewer.exe"
    ; (setq apdl-ansys-help-path "d:/Program Files/Ansys Inc/16.2.0/v201/commonfiles/help/en-us/help/")

    ; (setq apdl-ansys-help-path "/appl/ansys_inc/16.2.0/v201/commonfiles/help/en-us/help/")
    ; (setq apdl-ansys-launcher "/ansys_inc/v201/ansys/bin/launcher162")
    ; (setq apdl-ansys-wb "/ansys_inc/v201/Framework/bin/Linux64/runwb2")
    ; (setq apdl-ansys-program "/appl/ansys_inc/16.2.0/v201/ansys/bin/ansys162")
    ; (setq apdl-lmutil-program "/appl/ansys_inc/16.2.0/shared_files/licensing/linx64/lmutil")

#+END_SRC

* COMMENT Extending Emacs load path and initialisation
  redundant with package.el
#+BEGIN_SRC emacs-lisp :tangle yes

;; adding the directory of this (loaded) file to the load-path
(add-to-list 'load-path (file-name-directory load-file-name))
;; setting the APDL-Mode install directory
(setq apdl-mode-install-directory (file-name-directory load-file-name))
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                              ;; The End
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

;;; apdl-config.el ends here

;; Local Variables:
;; no-byte-compile: t
;; End:

#+END_SRC

* Ansys processes
** License server or license file

   The more license servers are specified in ~apdl-license-file~ the
   longer it takes to get the license status.

   License server configuration: License servers (or license file
   name) you have to specify also the port for (since Ansys V12.0).
   On GNU-Linux GNU-Linux: License servers are separated by colons
   (":"), on Windows with semicolon ";".  1055 is the default port.

   the following variable APDL-Mode is checking the environment
   variables AnsysLMD_LICENSE_FILE and MD_LICENSE_FILE.

   #+BEGIN_SRC emacs-lisp
     (setq apdl-license-file
       "1055@frlifl01.auto.contiwan.com:1055@frlifl02.auto.contiwan.com")
   #+END_SRC

   since Ansys 12.0 there is an intermediate server for the communication
   between flexlm and Ansys WorkBench, 2325 is here the default port.
   But the solver/interpreter is checking this server as well!?

   #+BEGIN_SRC emacs-lisp
   (setq apdl-ansysli-servers
      "2325@frlifl01.auto.contiwan.com:2325@frlifl02.auto.contiwan.com")
   #+END_SRC

