doc/apdl-config.org
** Solver options
   Number of cores for the run: 4 does not require HPC licenses
   #+BEGIN_SRC emacs-lisp
     (setq apdl-no-of-processors 8) ; default: 4
   #+END_SRC

   Which license type to use for the solver
   #+BEGIN_SRC emacs-lisp
     (setq apdl-license "struct") ; default: "ansys"
   #+END_SRC

   Ansys job name
   #+BEGIN_SRC emacs-lisp
     (setq apdl-job "harmonics1"); default: "file"
   #+END_SRC

#+BEGIN_SRC emacs-lisp :tangle yes :exports none
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                         ;; Ansys processes stuff
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
  ;; license server configuration


  ;; GNU-Linux 64 bit only !!! Warning specifiying many license server
  ;; takes a long time for displaying the license status!!!

   ;; for starting the solver & apdl-license-status & Ansys help
;  (setq                 ;
;   ;; license servers (or license file name)nn
;   ;; specify even the default port for lmutil (since Ansys V 12.0) on GNU-Linux
;   ;; GNU-Linux: License servers separated by colons (":"), 1055 is the default port
;   apdl-license-file
;  "32002@ls_fr_ansyslmd_ww_1.conti.de"
;   "32002@ls_fr_ansyslmd_ww_1.conti.de:32002@ls_fr_ansyslmd_ww_2.conti.de:32002@ls_fr_ansyslmd_ww_4.conti.de:1055@frlifl01.auto.contiwan.com:1055@frlifl02.auto.contiwan.com"

;   ;; since Ansys 12.0 there is an intermediate server for
;   ;; the communication between flexlm and Ansys, 2325 is the default port
;   apdl-ansysli-servers
;  "2325@ls_fr_ansyslmd_ww_1.conti.de"
;  "2325@ls_fr_ansyslmd_ww_1.conti.de:2325@ls_fr_ansyslmd_ww_3.conti.de:2325@ls_fr_ansyslmd_ww_4.conti.de:2325@frlifl01.auto.contiwan.com:2325@frlifl02.auto.contiwan.com"
;   )

  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                   ;; options when starting the solver
  ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

  ;; Number of cores for the run, 4 does not require HPC licenses
  ; (setq apdl-no-of-processors 8) ; default: 4

  ;;  which license type to use for the solver
  ; (setq apdl-license "struct") ; default: "ansys"

  ;; Ansys job name
  ; (setq apdl-job "harmonics1"); default: "file"

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
                              ;; The End
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(provide 'apdl-config)

;;; apdl-config.el ends here

;; Local Variables:
;; no-byte-compile: t
;; End:
#+END_SRC
-----

# Local Variables:
# word-wrap: t
# show-trailing-whitespace: t
# indicate-empty-lines: t
# time-stamp-active: t
# time-stamp-format: "%:y-%02m-%02d"
# End:

